Autodesk.Revit.DB.ElementMulticategoryFilter.GetCategoryIds
Gets the category ids assigned to this filter.
Returns:
The category ids.
Since:
2012

Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.BuiltInCategory},System.Boolean)
Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category.
categories:
The built-in categories to match.
inverted:
True if the filter should match all elements which are not of the given built-in categories.

Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.BuiltInCategory})
Constructs a new instance of a filter to match elements by built-in category.
categories:
The built-in categories to match.

Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Boolean)
Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to instead match elements which are not of the given categories.
categoryIds:
The category ids to match.
inverted:
True if the filter should match all elements which are not of the given categories.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more categories was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Constructs a new instance of a filter to find elements whose category matches any of a given set of categories.
categoryIds:
The category ids to match.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more categories was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementMulticategoryFilter
A filter used to find elements whose category matches any of a given set of categories.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2012